// let a = "123";
// console.log("2" * "3"); // выведет 6`

// console.log("2" * "3s"); // выведет    NaN

// let a = "1" + "2";
// console.log(a); // выведет    '12' - произошло    сложение строк

// let a = 1 + "2";
// console.log(a); // выведет '12'

// let a = "1" + (2 + 3);
// console.log(a); // выведет '15'

// let a = "1" + 2 + 3;
// console.log(a); // выведет '123'

// let a = 2 + 3 + "1";
// console.log(a); // выведет '51'

// let a = Number("2"); // в переменную запишется число 2
// let b = Number("3"); // в переменную запишется число 3
// console.log(a + b); // выведет 5

